#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
data.aws_vpc.vpc: Reading...
data.aws_ami.eks_optimized_ami: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_ami.eks_optimized_ami: Read complete after 0s [id=ami-084cf519d356bb718]
module.eks.module.eks_managed_node_group["nodes"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["nodes"].data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=081823476824]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=081823476824]
module.eks.module.eks_managed_node_group["nodes"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=081823476824]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::081823476824:user/macbook-pro]
data.aws_iam_policy_document.cluster_admin_role_assume_role_policy: Reading...
module.eks.module.eks_managed_node_group["nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.cluster_admin_role_assume_role_policy: Read complete after 0s [id=742408331]
module.eks.module.eks_managed_node_group["nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["nodes"].data.aws_caller_identity.current: Read complete after 0s [id=081823476824]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-c24e70bb]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 1s [id=us-west-2]
data.aws_eks_cluster_auth.cluster_auth: Reading...
data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=nesta]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.cluster_admin_role will be created
  + resource "aws_iam_role" "cluster_admin_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::081823476824:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "comcast-eks-cluster-admin-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + unique_id             = (known after apply)
    }

  # kubernetes_namespace.my_name_namespace will be created
  + resource "kubernetes_namespace" "my_name_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "nesta"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/nesta/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "/aws/eks/nesta/cluster"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all          = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "/aws/eks/nesta/cluster"
          + "OWNER"    = "NESTA_M"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["CATEGORY"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "CATEGORY"
      + resource_id = (known after apply)
      + value       = "ENG_ASSESSMENT"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GIT_REPO"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GIT_REPO"
      + resource_id = (known after apply)
      + value       = "nesta219/comcast-eks-assessment"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["OWNER"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "OWNER"
      + resource_id = (known after apply)
      + value       = "NESTA_M"
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "nesta"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all                  = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + version                   = "1.27"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-36ed031d",
              + "subnet-4678c60d",
              + "subnet-e7f26e9e",
              + "subnet-fc1760a6",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nesta-eks-irsa"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all        = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nesta-eks-irsa"
          + "OWNER"    = "NESTA_M"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "nesta-eks-service-role-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all    = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "The EKS cluster service role for the nesta role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "nesta-eks-service-role-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all              = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "nesta-eks-service-role"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "The cluster-level security group for the nesta EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nesta_eks_cluster_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nesta_eks_cluster_sg"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all               = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nesta_eks_cluster_sg"
          + "OWNER"    = "NESTA_M"
        }
      + vpc_id                 = "vpc-c24e70bb"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "The node-level security group for the nesta EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nesta_eks_node_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CATEGORY"                    = "ENG_ASSESSMENT"
          + "GIT_REPO"                    = "nesta219/comcast-eks-assessment"
          + "Name"                        = "nesta_eks_node_sg"
          + "OWNER"                       = "NESTA_M"
          + "kubernetes.io/cluster/nesta" = "owned"
        }
      + tags_all               = {
          + "CATEGORY"                    = "ENG_ASSESSMENT"
          + "GIT_REPO"                    = "nesta219/comcast-eks-assessment"
          + "Name"                        = "nesta_eks_node_sg"
          + "OWNER"                       = "NESTA_M"
          + "kubernetes.io/cluster/nesta" = "owned"
        }
      + vpc_id                 = "vpc-c24e70bb"
    }

  # module.eks.aws_security_group_rule.cluster["allow_ingress_from_specified_ip"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = [
          + "196.182.32.48/32",
        ]
      + description              = "Allow ingress from 196.182.32.48/32 per requirements"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["allow_ingress_from_specified_ip"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "196.182.32.48/32",
        ]
      + description              = "Allow ingress from 196.182.32.48/32 per requirements"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "nesta"
          + "cluster_version"                    = "1.27"
        }
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "nesta"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "c5.large",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "nodes-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-36ed031d",
          + "subnet-4678c60d",
          + "subnet-e7f26e9e",
          + "subnet-fc1760a6",
        ]
      + tags                   = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nodes"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all               = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "Name"     = "nodes"
          + "OWNER"    = "NESTA_M"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 4
          + max_size     = 6
          + min_size     = 3
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "nodes-eks-node-group-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all              = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodes"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for nodes EKS managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-084cf519d356bb718"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nodes-"
      + tags                   = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all               = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CATEGORY" = "ENG_ASSESSMENT"
              + "GIT_REPO" = "nesta219/comcast-eks-assessment"
              + "Name"     = "nodes"
              + "OWNER"    = "NESTA_M"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "CATEGORY" = "ENG_ASSESSMENT"
              + "GIT_REPO" = "nesta219/comcast-eks-assessment"
              + "Name"     = "nodes"
              + "OWNER"    = "NESTA_M"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "CATEGORY" = "ENG_ASSESSMENT"
              + "GIT_REPO" = "nesta219/comcast-eks-assessment"
              + "Name"     = "nodes"
              + "OWNER"    = "NESTA_M"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::081823476824:user/macbook-pro",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/nesta"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "nesta cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
      + tags_all                           = {
          + "CATEGORY" = "ENG_ASSESSMENT"
          + "GIT_REPO" = "nesta219/comcast-eks-assessment"
          + "OWNER"    = "NESTA_M"
        }
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ami_id             = "ami-084cf519d356bb718"
  + cluster_admin_role = (known after apply)
  + cluster_arn        = (known after apply)
  + cluster_name       = "nesta"
  + eks_cluster_id     = (known after apply)
  + subnets            = {
      + filter   = [
          + {
              + name   = "vpc-id"
              + values = [
                  + "vpc-c24e70bb",
                ]
            },
        ]
      + id       = "us-west-2"
      + ids      = [
          + "subnet-fc1760a6",
          + "subnet-e7f26e9e",
          + "subnet-4678c60d",
          + "subnet-36ed031d",
        ]
      + tags     = null
      + timeouts = null
    }
  + vpc_id             = "vpc-c24e70bb"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mn-throwaway, Action: `pull_request`*